zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXC/periph3/PERI_INPUTMUX.h
/*
** ###################################################################
**     Processors:          MCXC151VFG
**                          MCXC151VFK
**                          MCXC151VFM
**                          MCXC151VFT
**                          MCXC151VLF
**                          MCXC161VFG
**                          MCXC161VFK
**                          MCXC161VFM
**                          MCXC161VFT
**                          MCXC161VLF
**                          MCXC162VFG
**                          MCXC162VFK
**                          MCXC162VFM
**                          MCXC162VFT
**                          MCXC162VLF
**
**     Version:             rev. 1.0, 2024-11-21
**     Build:               b260714
**
**     Abstract:
**         CMSIS Peripheral Access Layer for INPUTMUX
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2024-11-21)
**         Initial version based on Rev1 RM
**
** ###################################################################
*/

/*!
 * @file PERI_INPUTMUX.h
 * @version 1.0
 * @date 2024-11-21
 * @brief CMSIS Peripheral Access Layer for INPUTMUX
 *
 * CMSIS Peripheral Access Layer for INPUTMUX
 */

#if !defined(PERI_INPUTMUX_H_)
#define PERI_INPUTMUX_H_                         /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXC151VFG) || defined(CPU_MCXC151VFK) || defined(CPU_MCXC151VFM) || defined(CPU_MCXC151VFT) || defined(CPU_MCXC151VLF))
#include "MCXC151_COMMON.h"
#elif (defined(CPU_MCXC161VFG) || defined(CPU_MCXC161VFK) || defined(CPU_MCXC161VFM) || defined(CPU_MCXC161VFT) || defined(CPU_MCXC161VLF))
#include "MCXC161_COMMON.h"
#elif (defined(CPU_MCXC162VFG) || defined(CPU_MCXC162VFK) || defined(CPU_MCXC162VFM) || defined(CPU_MCXC162VFT) || defined(CPU_MCXC162VLF))
#include "MCXC162_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- INPUTMUX Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup INPUTMUX_Peripheral_Access_Layer INPUTMUX Peripheral Access Layer
 * @{
 */

/** INPUTMUX - Size of Registers Arrays */
#define INPUTMUX_CTIMERA_COUNT                    4u
#define INPUTMUX_CTIMERB_COUNT                    4u
#define INPUTMUX_ADC0_TRIGM_COUNT                 4u
#define INPUTMUX_TRIGFILP_COUNT                   12u

/** INPUTMUX - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[32];
  __IO uint32_t CTIMER0CAP[INPUTMUX_CTIMERA_COUNT]; /**< Capture Select for CTIMER0 Inputs, array offset: 0x20, array step: 0x4 */
  __IO uint32_t CTIMER0TRIG;                       /**< Trigger for CTIMER0, offset: 0x30 */
       uint8_t RESERVED_1[12];
  __IO uint32_t CTIMER1CAP[INPUTMUX_CTIMERB_COUNT]; /**< Capture Select for CTIMER1 Inputs, array offset: 0x40, array step: 0x4 */
  __IO uint32_t CTIMER1TRIG;                       /**< Trigger for CTIMER1, offset: 0x50 */
       uint8_t RESERVED_2[300];
  __IO uint32_t FREQMEAS_REF;                      /**< FREQME Reference Clock Selection, offset: 0x180 */
  __IO uint32_t FREQMEAS_TAR;                      /**< FREQME Target Clock Selection, offset: 0x184 */
       uint8_t RESERVED_3[216];
  __IO uint32_t CMP0_TRIG;                         /**< LPCMP0 Input Connections, offset: 0x260 */
       uint8_t RESERVED_4[28];
  __IO uint32_t ADC0_TRIG[INPUTMUX_ADC0_TRIGM_COUNT]; /**< ADC0 Trigger Input Connections, array offset: 0x280, array step: 0x4 */
       uint8_t RESERVED_5[272];
  __IO uint32_t FLEXPWM0_SM0_EXTA;                 /**< eFlexPWM0 SM0 EXTA Input Trigger Connections, offset: 0x3A0 */
  __IO uint32_t FLEXPWM0_SM0_EXTSYNC;              /**< eFlexPWM0 SM0 EXT_SYNC Input Trigger Connections, offset: 0x3A4 */
  __IO uint32_t FLEXPWM0_SM1_EXTA;                 /**< eFlexPWM0 SM1 EXTA Input Trigger Connections, offset: 0x3A8 */
  __IO uint32_t FLEXPWM0_SM1_EXTSYNC;              /**< eFlexPWM0 SM1 EXT_SYNC Input Trigger Connections, offset: 0x3AC */
  __IO uint32_t FLEXPWM0_SM2_EXTA;                 /**< eFlexPWM0 SM2 EXTA Input Trigger Connections, offset: 0x3B0 */
  __IO uint32_t FLEXPWM0_SM2_EXTSYNC;              /**< eFlexPWM0 SM2 EXT_SYNC Input Trigger Connections, offset: 0x3B4 */
       uint8_t RESERVED_6[8];
  __IO uint32_t FLEXPWM0_FAULT0;                   /**< eFlexPWM0 FAULT0 Input Trigger Connections, offset: 0x3C0 */
  __IO uint32_t FLEXPWM0_FAULT1;                   /**< eFlexPWM0 FAULT1 Input Trigger Connections, offset: 0x3C4 */
  __IO uint32_t FLEXPWM0_FAULT2;                   /**< eFlexPWM0 FAULT2 Input Trigger Connection, offset: 0x3C8 */
  __IO uint32_t FLEXPWM0_FAULT3;                   /**< eFlexPWM0 FAULT3 Input Trigger Connection, offset: 0x3CC */
  __IO uint32_t FLEXPWM0_FORCE;                    /**< eFlexPWM0 EXT_FORCE Input Trigger Connection, offset: 0x3D0 */
       uint8_t RESERVED_7[76];
  __IO uint32_t PWM0_EXT_CLK;                      /**< eFlexPWM0 EXT_CLK Trigger, offset: 0x420 */
       uint8_t RESERVED_8[156];
  __IO uint32_t EXT_TRIG0;                         /**< External Trigger a Connections, offset: 0x4C0 */
  __IO uint32_t EXT_TRIG1;                         /**< External Trigger a Connections, offset: 0x4C4 */
  __IO uint32_t EXT_TRIG2;                         /**< External Trigger a Connections, offset: 0x4C8 */
  __IO uint32_t EXT_TRIG3;                         /**< External Trigger a Connections, offset: 0x4CC */
  __IO uint32_t EXT_TRIG4;                         /**< External Trigger a Connections, offset: 0x4D0 */
       uint8_t RESERVED_9[4];
  __IO uint32_t EXT_TRIG6;                         /**< External Trigger a Connections, offset: 0x4D8 */
  __IO uint32_t EXT_TRIG7;                         /**< External Trigger a Connections, offset: 0x4DC */
       uint8_t RESERVED_10[192];
  __IO uint32_t LPI2C0_TRIG;                       /**< LPI2C0 Trigger Input Connections, offset: 0x5A0 */
       uint8_t RESERVED_11[60];
  __IO uint32_t LPSPI0_TRIG;                       /**< LPSPI0 Trigger Input Connections, offset: 0x5E0 */
       uint8_t RESERVED_12[60];
  __IO uint32_t LPUART0r;                          /**< LPUART0 Trigger Input Connections, offset: 0x620, 'r' suffix has been added to avoid a clash with peripheral base pointer macro 'LPUART0' */
       uint8_t RESERVED_13[28];
  __IO uint32_t LPUART1r;                          /**< LPUART1 Trigger Input Connections, offset: 0x640, 'r' suffix has been added to avoid a clash with peripheral base pointer macro 'LPUART1' */
       uint8_t RESERVED_14[28];
  __IO uint32_t LPUART2r;                          /**< LPUART2 Trigger Input Connections, offset: 0x660, 'r' suffix has been added to avoid a clash with peripheral base pointer macro 'LPUART2' */
       uint8_t RESERVED_15[28];
  __IO uint32_t LPUART3r;                          /**< LPUART3 Trigger Input Connections, offset: 0x680, 'r' suffix has been added to avoid a clash with peripheral base pointer macro 'LPUART3' */
       uint8_t RESERVED_16[892];
  __IO uint32_t TRIGFIL_PRSC;                      /**< Trigger Filter Prescaller, offset: 0xA00 */
  __I  uint32_t TRIGFIL_STAT0;                     /**< Trigger Filter Status, offset: 0xA04 */
       uint8_t RESERVED_17[8];
  __IO uint32_t TRIGFIL[INPUTMUX_TRIGFILP_COUNT];  /**< TRIGFIL Control, array offset: 0xA10, array step: 0x4 */
} INPUTMUX_Type;

/* ----------------------------------------------------------------------------
   -- INPUTMUX Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup INPUTMUX_Register_Masks INPUTMUX Register Masks
 * @{
 */

/*! @name CTIMERA_CTIMER0CAP - Capture Select for CTIMER0 Inputs */
/*! @{ */

#define INPUTMUX_CTIMERA_CTIMER0CAP_INP_MASK     (0x7FU)
#define INPUTMUX_CTIMERA_CTIMER0CAP_INP_SHIFT    (0U)
/*! INP - Capture Input a for CTIMER0
 *  0b0000000..Reserved
 *  0b0000001..CT_INP0 input is selected
 *  0b0000010..CT_INP1 input is selected
 *  0b0000011..CT_INP2 input is selected
 *  0b0000100..CT_INP3 input is selected
 *  0b0000101..CT_INP4 input is selected
 *  0b0000110..CT_INP5 input is selected
 *  0b0000111..CT_INP6 input is selected
 *  0b0001000..Reserved
 *  0b0001001..CT_INP8 input is selected
 *  0b0001010..CT_INP9 input is selected
 *  0b0001011..Reserved
 *  0b0001100..Reserved
 *  0b0001101..CT_INP12 input is selected
 *  0b0001110..CT_INP13 input is selected
 *  0b0001111..Reserved
 *  0b0010000..Reserved
 *  0b0010001..CT_INP16 input is selected
 *  0b0010010..CT_INP17 input is selected
 *  0b0010011..CT_INP18 input is selected
 *  0b0010100..CT_INP19 input is selected
 *  0b0010101..Reserved
 *  0b0010110..Reserved
 *  0b0010111..Reserved
 *  0b0011000..Reserved
 *  0b0011001..Reserved
 *  0b0011010..ADC0_tcomp[0] input is selected
 *  0b0011011..ADC0_tcomp[1] input is selected
 *  0b0011100..ADC0_tcomp[2] input is selected
 *  0b0011101..ADC0_tcomp[3] input is selected
 *  0b0011110..CMP0_OUT input is selected
 *  0b0011111..Reserved
 *  0b0100000..Reserved
 *  0b0100001..CTimer1_MAT1 input is selected
 *  0b0100010..CTimer1_MAT2 input is selected
 *  0b0100011..CTimer1_MAT3 input is selected
 *  0b0100100..Reserved
 *  0b0100101..Reserved
 *  0b0100110..Reserved
 *  0b0100111..Reserved
 *  0b0101000..Reserved
 *  0b0101001..Reserved
 *  0b0101010..Reserved
 *  0b0101011..Reserved
 *  0b0101100..PWM0_SM0_MUX_TRIG0 input is selected
 *  0b0101101..PWM0_SM1_MUX_TRIG0 input is selected
 *  0b0101110..PWM0_SM2_MUX_TRIG0 input is selected
 *  0b0101111..Reserved
 *  0b0110000..LPI2C0 Master End of Packet input is selected
 *  0b0110001..LPI2C0 Slave End of Packet input is selected
 *  0b0110010..Reserved
 *  0b0110011..Reserved
 *  0b0110100..LPSPI0 End of Frame input is selected
 *  0b0110101..LPSPI0 Received Data Word input is selected
 *  0b0110110..Reserved
 *  0b0110111..Reserved
 *  0b0111000..LPUART0 Received Data Word input is selected
 *  0b0111001..LPUART0 Transmitted Data Word input is selected
 *  0b0111010..LPUART0 Receive Line Idle input is selected
 *  0b0111011..LPUART1 Received Data Word input is selected
 *  0b0111100..LPUART1 Transmitted Data Word input is selected
 *  0b0111101..LPUART1 Receive Line Idle input is selected
 *  0b0111110..LPUART2 Received Data Word input is selected
 *  0b0111111..LPUART2 Transmitted Data Word input is selected
 *  0b1000000..LPUART2 Receive Line Idle input is selected
 *  0b1000001..TRIG_IN0 input is selected
 *  0b1000010..TRIG_IN1 input is selected
 *  0b1000011..TRIG_IN2 input is selected
 *  0b1000100..TRIG_IN3 input is selected
 *  0b1000101..TRIG_IN4 input is selected
 *  0b1000110..TRIG_IN5 input is selected
 *  0b1000111..TRIG_IN6 input is selected
 *  0b1001000..TRIG_IN7 input is selected
 *  0b1001001..TRIG_IN8 input is selected
 *  0b1001010..TRIG_IN9 input is selected
 *  0b1001011..TRIG_IN10 input is selected
 *  0b1001100..TRIG_IN11 input is selected
 *  0b1001101..LPUART3 Received Data Word input is selected
 *  0b1001110..LPUART3 Transmitted Data Word input is selected
 *  0b1001111..LPUART3 Receive Line Idle input is selected
 */
#define INPUTMUX_CTIMERA_CTIMER0CAP_INP(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_CTIMERA_CTIMER0CAP_INP_SHIFT)) & INPUTMUX_CTIMERA_CTIMER0CAP_INP_MASK)
/*! @} */

