zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXC/periph3/PERI_INPUTMUX.h
/* The count of INPUTMUX_CTIMERA_CTIMER0CAP */
#define INPUTMUX_CTIMERA_CTIMER0CAP_COUNT        (4U)

/*! @name CTIMER0TRIG - Trigger for CTIMER0 */
/*! @{ */

#define INPUTMUX_CTIMER0TRIG_INP_MASK            (0x7FU)
#define INPUTMUX_CTIMER0TRIG_INP_SHIFT           (0U)
/*! INP - Trigger Input for CTIMER0
 *  0b0000000..Reserved
 *  0b0000001..CT_INP0 input is selected
 *  0b0000010..CT_INP1 input is selected
 *  0b0000011..CT_INP2 input is selected
 *  0b0000100..CT_INP3 input is selected
 *  0b0000101..CT_INP4 input is selected
 *  0b0000110..CT_INP5 input is selected
 *  0b0000111..CT_INP6 input is selected
 *  0b0001000..Reserved
 *  0b0001001..CT_INP8 input is selected
 *  0b0001010..CT_INP9 input is selected
 *  0b0001011..Reserved
 *  0b0001100..Reserved
 *  0b0001101..CT_INP12 input is selected
 *  0b0001110..CT_INP13 input is selected
 *  0b0001111..Reserved
 *  0b0010000..Reserved
 *  0b0010001..CT_INP16 input is selected
 *  0b0010010..CT_INP17 input is selected
 *  0b0010011..CT_INP18 input is selected
 *  0b0010100..CT_INP19 input is selected
 *  0b0010101..Reserved
 *  0b0010110..Reserved
 *  0b0010111..Reserved
 *  0b0011000..Reserved
 *  0b0011001..Reserved
 *  0b0011010..ADC0_tcomp[0] input is selected
 *  0b0011011..ADC0_tcomp[1] input is selected
 *  0b0011100..ADC0_tcomp[2] input is selected
 *  0b0011101..ADC0_tcomp[3] input is selected
 *  0b0011110..CMP0_OUT input is selected
 *  0b0011111..Reserved
 *  0b0100000..Reserved
 *  0b0100001..CTimer1_MAT1 input is selected
 *  0b0100010..CTimer1_MAT2 input is selected
 *  0b0100011..CTimer1_MAT3 input is selected
 *  0b0100100..Reserved
 *  0b0100101..Reserved
 *  0b0100110..Reserved
 *  0b0100111..Reserved
 *  0b0101000..Reserved
 *  0b0101001..Reserved
 *  0b0101010..Reserved
 *  0b0101011..Reserved
 *  0b0101100..PWM0_SM0_MUX_TRIG0 input is selected
 *  0b0101101..PWM0_SM1_MUX_TRIG0 input is selected
 *  0b0101110..PWM0_SM2_MUX_TRIG0 input is selected
 *  0b0101111..Reserved
 *  0b0110000..LPI2C0 Master End of Packet input is selected
 *  0b0110001..LPI2C0 Slave End of Packet input is selected
 *  0b0110010..Reserved
 *  0b0110011..Reserved
 *  0b0110100..LPSPI0 End of Frame input is selected
 *  0b0110101..LPSPI0 Received Data Word input is selected
 *  0b0110110..Reserved
 *  0b0110111..Reserved
 *  0b0111000..LPUART0 Received Data Word input is selected
 *  0b0111001..LPUART0 Transmitted Data Word input is selected
 *  0b0111010..LPUART0 Receive Line Idle input is selected
 *  0b0111011..LPUART1 Received Data Word input is selected
 *  0b0111100..LPUART1 Transmitted Data Word input is selected
 *  0b0111101..LPUART1 Receive Line Idle input is selected
 *  0b0111110..LPUART2 Received Data Word input is selected
 *  0b0111111..LPUART2 Transmitted Data Word input is selected
 *  0b1000000..LPUART2 Receive Line Idle input is selected
 *  0b1000001..TRIG_IN0 input is selected
 *  0b1000010..TRIG_IN1 input is selected
 *  0b1000011..TRIG_IN2 input is selected
 *  0b1000100..TRIG_IN3 input is selected
 *  0b1000101..TRIG_IN4 input is selected
 *  0b1000110..TRIG_IN5 input is selected
 *  0b1000111..TRIG_IN6 input is selected
 *  0b1001000..TRIG_IN7 input is selected
 *  0b1001001..TRIG_IN8 input is selected
 *  0b1001010..TRIG_IN9 input is selected
 *  0b1001011..TRIG_IN10 input is selected
 *  0b1001100..TRIG_IN11 input is selected
 *  0b1001101..LPUART3 Received Data Word input is selected
 *  0b1001110..LPUART3 Transmitted Data Word input is selected
 *  0b1001111..LPUART3 Receive Line Idle input is selected
 */
#define INPUTMUX_CTIMER0TRIG_INP(x)              (((uint32_t)(((uint32_t)(x)) << INPUTMUX_CTIMER0TRIG_INP_SHIFT)) & INPUTMUX_CTIMER0TRIG_INP_MASK)
/*! @} */

/*! @name CTIMERB_CTIMER1CAP - Capture Select for CTIMER1 Inputs */
/*! @{ */

#define INPUTMUX_CTIMERB_CTIMER1CAP_INP_MASK     (0x7FU)
#define INPUTMUX_CTIMERB_CTIMER1CAP_INP_SHIFT    (0U)
/*! INP - Capture Input a for CTIMER1
 *  0b0000000..Reserved
 *  0b0000001..CT_INP0 input is selected
 *  0b0000010..CT_INP1 input is selected
 *  0b0000011..CT_INP2 input is selected
 *  0b0000100..CT_INP3 input is selected
 *  0b0000101..CT_INP4 input is selected
 *  0b0000110..CT_INP5 input is selected
 *  0b0000111..CT_INP6 input is selected
 *  0b0001000..Reserved
 *  0b0001001..CT_INP8 input is selected
 *  0b0001010..CT_INP9 input is selected
 *  0b0001011..Reserved
 *  0b0001100..Reserved
 *  0b0001101..CT_INP12 input is selected
 *  0b0001110..CT_INP13 input is selected
 *  0b0001111..Reserved
 *  0b0010000..Reserved
 *  0b0010001..CT_INP16 input is selected
 *  0b0010010..CT_INP17 input is selected
 *  0b0010011..CT_INP18 input is selected
 *  0b0010100..CT_INP19 input is selected
 *  0b0010101..Reserved
 *  0b0010110..Reserved
 *  0b0010111..Reserved
 *  0b0011000..Reserved
 *  0b0011001..Reserved
 *  0b0011010..ADC0_tcomp[0] input is selected
 *  0b0011011..ADC0_tcomp[1] input is selected
 *  0b0011100..ADC0_tcomp[2] input is selected
 *  0b0011101..ADC0_tcomp[3] input is selected
 *  0b0011110..CMP0_OUT input is selected
 *  0b0011111..Reserved
 *  0b0100000..Reserved
 *  0b0100001..CTimer0_MAT1 input is selected
 *  0b0100010..CTimer0_MAT2 input is selected
 *  0b0100011..CTimer0_MAT3 input is selected
 *  0b0100100..Reserved
 *  0b0100101..Reserved
 *  0b0100110..Reserved
 *  0b0100111..Reserved
 *  0b0101000..Reserved
 *  0b0101001..Reserved
 *  0b0101010..Reserved
 *  0b0101011..Reserved
 *  0b0101100..PWM0_SM0_MUX_TRIG0 input is selected
 *  0b0101101..PWM0_SM1_MUX_TRIG0 input is selected
 *  0b0101110..PWM0_SM2_MUX_TRIG0 input is selected
 *  0b0101111..Reserved
 *  0b0110000..LPI2C0 Master End of Packet input is selected
 *  0b0110001..LPI2C0 Slave End of Packet input is selected
 *  0b0110010..Reserved
 *  0b0110011..Reserved
 *  0b0110100..LPSPI0 End of Frame input is selected
 *  0b0110101..LPSPI0 Received Data Word input is selected
 *  0b0110110..Reserved
 *  0b0110111..Reserved
 *  0b0111000..LPUART0 Received Data Word input is selected
 *  0b0111001..LPUART0 Transmitted Data Word input is selected
 *  0b0111010..LPUART0 Receive Line Idle input is selected
 *  0b0111011..LPUART1 Received Data Word input is selected
 *  0b0111100..LPUART1 Transmitted Data Word input is selected
 *  0b0111101..LPUART1 Receive Line Idle input is selected
 *  0b0111110..LPUART2 Received Data Word input is selected
 *  0b0111111..LPUART2 Transmitted Data Word input is selected
 *  0b1000000..LPUART2 Receive Line Idle input is selected
 *  0b1000001..TRIG_IN0 input is selected
 *  0b1000010..TRIG_IN1 input is selected
 *  0b1000011..TRIG_IN2 input is selected
 *  0b1000100..TRIG_IN3 input is selected
 *  0b1000101..TRIG_IN4 input is selected
 *  0b1000110..TRIG_IN5 input is selected
 *  0b1000111..TRIG_IN6 input is selected
 *  0b1001000..TRIG_IN7 input is selected
 *  0b1001001..TRIG_IN8 input is selected
 *  0b1001010..TRIG_IN9 input is selected
 *  0b1001011..TRIG_IN10 input is selected
 *  0b1001100..TRIG_IN11 input is selected
 *  0b1001101..LPUART3 Received Data Word input is selected
 *  0b1001110..LPUART3 Transmitted Data Word input is selected
 *  0b1001111..LPUART3 Receive Line Idle input is selected
 */
#define INPUTMUX_CTIMERB_CTIMER1CAP_INP(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_CTIMERB_CTIMER1CAP_INP_SHIFT)) & INPUTMUX_CTIMERB_CTIMER1CAP_INP_MASK)
/*! @} */

/* The count of INPUTMUX_CTIMERB_CTIMER1CAP */
#define INPUTMUX_CTIMERB_CTIMER1CAP_COUNT        (4U)

