zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXC/periph3/PERI_INPUTMUX.h
/*! @name CTIMER1TRIG - Trigger for CTIMER1 */
/*! @{ */

#define INPUTMUX_CTIMER1TRIG_INP_MASK            (0x7FU)
#define INPUTMUX_CTIMER1TRIG_INP_SHIFT           (0U)
/*! INP - Trigger Input for CTIMER1
 *  0b0000000..Reserved
 *  0b0000001..CT_INP0 input is selected
 *  0b0000010..CT_INP1 input is selected
 *  0b0000011..CT_INP2 input is selected
 *  0b0000100..CT_INP3 input is selected
 *  0b0000101..CT_INP4 input is selected
 *  0b0000110..CT_INP5 input is selected
 *  0b0000111..CT_INP6 input is selected
 *  0b0001000..Reserved
 *  0b0001001..CT_INP8 input is selected
 *  0b0001010..CT_INP9 input is selected
 *  0b0001011..Reserved
 *  0b0001100..Reserved
 *  0b0001101..CT_INP12 input is selected
 *  0b0001110..CT_INP13 input is selected
 *  0b0001111..Reserved
 *  0b0010000..Reserved
 *  0b0010001..CT_INP16 input is selected
 *  0b0010010..CT_INP17 input is selected
 *  0b0010011..CT_INP18 input is selected
 *  0b0010100..CT_INP19 input is selected
 *  0b0010101..Reserved
 *  0b0010110..Reserved
 *  0b0010111..Reserved
 *  0b0011000..Reserved
 *  0b0011001..Reserved
 *  0b0011010..ADC0_tcomp[0] input is selected
 *  0b0011011..ADC0_tcomp[1] input is selected
 *  0b0011100..ADC0_tcomp[2] input is selected
 *  0b0011101..ADC0_tcomp[3] input is selected
 *  0b0011110..CMP0_OUT input is selected
 *  0b0011111..Reserved
 *  0b0100000..Reserved
 *  0b0100001..CTimer0_MAT1 input is selected
 *  0b0100010..CTimer0_MAT2 input is selected
 *  0b0100011..CTimer0_MAT3 input is selected
 *  0b0100100..Reserved
 *  0b0100101..Reserved
 *  0b0100110..Reserved
 *  0b0100111..Reserved
 *  0b0101000..Reserved
 *  0b0101001..Reserved
 *  0b0101010..Reserved
 *  0b0101011..Reserved
 *  0b0101100..PWM0_SM0_MUX_TRIG0 input is selected
 *  0b0101101..PWM0_SM1_MUX_TRIG0 input is selected
 *  0b0101110..PWM0_SM2_MUX_TRIG0 input is selected
 *  0b0101111..Reserved
 *  0b0110000..LPI2C0 Master End of Packet input is selected
 *  0b0110001..LPI2C0 Slave End of Packet input is selected
 *  0b0110010..Reserved
 *  0b0110011..Reserved
 *  0b0110100..LPSPI0 End of Frame input is selected
 *  0b0110101..LPSPI0 Received Data Word input is selected
 *  0b0110110..Reserved
 *  0b0110111..Reserved
 *  0b0111000..LPUART0 Received Data Word input is selected
 *  0b0111001..LPUART0 Transmitted Data Word input is selected
 *  0b0111010..LPUART0 Receive Line Idle input is selected
 *  0b0111011..LPUART1 Received Data Word input is selected
 *  0b0111100..LPUART1 Transmitted Data Word input is selected
 *  0b0111101..LPUART1 Receive Line Idle input is selected
 *  0b0111110..LPUART2 Received Data Word input is selected
 *  0b0111111..LPUART2 Transmitted Data Word input is selected
 *  0b1000000..LPUART2 Receive Line Idle input is selected
 *  0b1000001..TRIG_IN0 input is selected
 *  0b1000010..TRIG_IN1 input is selected
 *  0b1000011..TRIG_IN2 input is selected
 *  0b1000100..TRIG_IN3 input is selected
 *  0b1000101..TRIG_IN4 input is selected
 *  0b1000110..TRIG_IN5 input is selected
 *  0b1000111..TRIG_IN6 input is selected
 *  0b1001000..TRIG_IN7 input is selected
 *  0b1001001..TRIG_IN8 input is selected
 *  0b1001010..TRIG_IN9 input is selected
 *  0b1001011..TRIG_IN10 input is selected
 *  0b1001100..TRIG_IN11 input is selected
 *  0b1001101..LPUART3 Received Data Word input is selected
 *  0b1001110..LPUART3 Transmitted Data Word input is selected
 *  0b1001111..LPUART3 Receive Line Idle input is selected
 */
#define INPUTMUX_CTIMER1TRIG_INP(x)              (((uint32_t)(((uint32_t)(x)) << INPUTMUX_CTIMER1TRIG_INP_SHIFT)) & INPUTMUX_CTIMER1TRIG_INP_MASK)
/*! @} */

/*! @name FREQMEAS_REF - FREQME Reference Clock Selection */
/*! @{ */

#define INPUTMUX_FREQMEAS_REF_INP_MASK           (0x3FU)
#define INPUTMUX_FREQMEAS_REF_INP_SHIFT          (0U)
/*! INP - Clock source (binary value) for frequency measure function reference clock.
 *  0b000000..Reserved
 *  0b000001..clk_in input is selected
 *  0b000010..FRO_OSC_12M input is selected
 *  0b000011..fro_hf_div input is selected
 *  0b000100..Osc32k[1] input is selected
 *  0b000101..clk_16k[1] input is selected
 *  0b000110..SLOW_CLK input is selected
 *  0b000111..FREQME_CLK_IN0 input is selected
 *  0b001000..FREQME_CLK_IN1 input is selected
 *  0b001001..Reserved
 *  0b001010..Reserved
 *  0b001011..PWM0_SM0_MUX_TRIG0 input is selected
 *  0b001100..PWM0_SM0_MUX_TRIG1 input is selected
 *  0b001101..PWM0_SM1_MUX_TRIG0 input is selected
 *  0b001110..PWM0_SM1_MUX_TRIG1 input is selected
 *  0b001111..PWM0_SM2_MUX_TRIG0 input is selected
 *  0b010000..PWM0_SM2_MUX_TRIG1 input is selected
 */
#define INPUTMUX_FREQMEAS_REF_INP(x)             (((uint32_t)(((uint32_t)(x)) << INPUTMUX_FREQMEAS_REF_INP_SHIFT)) & INPUTMUX_FREQMEAS_REF_INP_MASK)
/*! @} */

/*! @name FREQMEAS_TAR - FREQME Target Clock Selection */
/*! @{ */

#define INPUTMUX_FREQMEAS_TAR_INP_MASK           (0x3FU)
#define INPUTMUX_FREQMEAS_TAR_INP_SHIFT          (0U)
/*! INP - Clock source (binary value) for frequency measure function target clock.
 *  0b000000..Reserved
 *  0b000001..clk_in input is selected
 *  0b000010..FRO_OSC_12M input is selected
 *  0b000011..fro_hf_div input is selected
 *  0b000100..Osc32k[1] input is selected
 *  0b000101..clk_16k[1] input is selected
 *  0b000110..SLOW_CLK input is selected
 *  0b000111..FREQME_CLK_IN0 input is selected
 *  0b001000..FREQME_CLK_IN1 input is selected
 *  0b001001..Reserved
 *  0b001010..Reserved
 *  0b001011..PWM0_SM0_MUX_TRIG0 input is selected
 *  0b001100..PWM0_SM0_MUX_TRIG1 input is selected
 *  0b001101..PWM0_SM1_MUX_TRIG0 input is selected
 *  0b001110..PWM0_SM1_MUX_TRIG1 input is selected
 *  0b001111..PWM0_SM2_MUX_TRIG0 input is selected
 *  0b010000..PWM0_SM2_MUX_TRIG1 input is selected
 */
#define INPUTMUX_FREQMEAS_TAR_INP(x)             (((uint32_t)(((uint32_t)(x)) << INPUTMUX_FREQMEAS_TAR_INP_SHIFT)) & INPUTMUX_FREQMEAS_TAR_INP_MASK)
/*! @} */

/*! @name CMP0_TRIG - LPCMP0 Input Connections */
/*! @{ */

#define INPUTMUX_CMP0_TRIG_TRIGIN_MASK           (0x1FU)
#define INPUTMUX_CMP0_TRIG_TRIGIN_SHIFT          (0U)
/*! TRIGIN - LPCMP0 Input Trigger
 *  0b00000..Reserved
 *  0b00001..Reserved
 *  0b00010..Reserved
 *  0b00011..Reserved
 *  0b00100..Reserved
 *  0b00101..Reserved
 *  0b00110..Reserved
 *  0b00111..Reserved
 *  0b01000..CTimer0_MAT0 input is selected
 *  0b01001..CTimer0_MAT2 input is selected
 *  0b01010..CTimer1_MAT0 input is selected
 *  0b01011..CTimer1_MAT2 input is selected
 *  0b01100..Reserved
 *  0b01101..Reserved
 *  0b01110..LPTMR0 input is selected
 *  0b01111..Reserved
 *  0b10000..Reserved
 *  0b10001..PWM0_SM0_MUX_TRIG0 input is selected
 *  0b10010..PWM0_SM0_MUX_TRIG1 input is selected
 *  0b10011..PWM0_SM1_MUX_TRIG0 input is selected
 *  0b10100..PWM0_SM1_MUX_TRIG1 input is selected
 *  0b10101..PWM0_SM2_MUX_TRIG0 input is selected
 *  0b10110..PWM0_SM2_MUX_TRIG1 input is selected
 *  0b10111..Reserved
 *  0b11000..Reserved
 *  0b11001..GPIO0 Pin Event Trig 0 input is selected
 *  0b11010..GPIO1 Pin Event Trig 0 input is selected
 *  0b11011..GPIO2 Pin Event Trig 0 input is selected
 *  0b11100..GPIO3 Pin Event Trig 0 input is selected
 *  0b11101..Reserved
 *  0b11110..WUU input is selected
 */
#define INPUTMUX_CMP0_TRIG_TRIGIN(x)             (((uint32_t)(((uint32_t)(x)) << INPUTMUX_CMP0_TRIG_TRIGIN_SHIFT)) & INPUTMUX_CMP0_TRIG_TRIGIN_MASK)
/*! @} */

/*! @name ADC0_TRIGM_ADC0_TRIG - ADC0 Trigger Input Connections */
/*! @{ */

#define INPUTMUX_ADC0_TRIGM_ADC0_TRIG_TRIGIN_MASK (0x1FU)
#define INPUTMUX_ADC0_TRIGM_ADC0_TRIG_TRIGIN_SHIFT (0U)
/*! TRIGIN - ADC0 Trigger a Inputs
 *  0b00000..Reserved
 *  0b00001..ARM_TXEV input is selected
 *  0b00010..Reserved
 *  0b00011..Reserved
 *  0b00100..Reserved
 *  0b00101..Reserved
 *  0b00110..CMP0_OUT input is selected
 *  0b00111..Reserved
 *  0b01000..Reserved
 *  0b01001..CTimer0_MAT0 input is selected
 *  0b01010..CTimer0_MAT1 input is selected
 *  0b01011..CTimer1_MAT0 input is selected
 *  0b01100..CTimer1_MAT1 input is selected
 *  0b01101..Reserved
 *  0b01110..Reserved
 *  0b01111..LPTMR0 input is selected
 *  0b10000..Reserved
 *  0b10001..Reserved
 *  0b10010..PWM0_SM0_MUX_TRIG0 input is selected
 *  0b10011..PWM0_SM0_MUX_TRIG1 input is selected
 *  0b10100..PWM0_SM1_MUX_TRIG0 input is selected
 *  0b10101..PWM0_SM1_MUX_TRIG1 input is selected
 *  0b10110..PWM0_SM2_MUX_TRIG0 input is selected
 *  0b10111..PWM0_SM2_MUX_TRIG1 input is selected
 *  0b11000..Reserved
 *  0b11001..Reserved
 *  0b11010..GPIO0 Pin Event Trig 0 input is selected
 *  0b11011..GPIO1 Pin Event Trig 0 input is selected
 *  0b11100..GPIO2 Pin Event Trig 0 input is selected
 *  0b11101..GPIO3 Pin Event Trig 0 input is selected
 *  0b11110..Reserved
 *  0b11111..WUU input is selected
 */
#define INPUTMUX_ADC0_TRIGM_ADC0_TRIG_TRIGIN(x)  (((uint32_t)(((uint32_t)(x)) << INPUTMUX_ADC0_TRIGM_ADC0_TRIG_TRIGIN_SHIFT)) & INPUTMUX_ADC0_TRIGM_ADC0_TRIG_TRIGIN_MASK)
/*! @} */

/* The count of INPUTMUX_ADC0_TRIGM_ADC0_TRIG */
#define INPUTMUX_ADC0_TRIGM_ADC0_TRIG_COUNT      (4U)

