zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXC/periph3/PERI_INPUTMUX.h
/*! @name PWM0_EXT_CLK - eFlexPWM0 EXT_CLK Trigger */
/*! @{ */

#define INPUTMUX_PWM0_EXT_CLK_INP_MASK           (0x7U)
#define INPUTMUX_PWM0_EXT_CLK_INP_SHIFT          (0U)
/*! INP - Input Trigger Connection for eFlexPWM0 EXT_CLK
 *  0b000..Reserved
 *  0b001..clk_16k[1] input is selected
 *  0b010..clk_in input is selected
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..TRIG_IN0 input is selected
 *  0b110..TRIG_IN7 input is selected
 *  0b111..Reserved
 */
#define INPUTMUX_PWM0_EXT_CLK_INP(x)             (((uint32_t)(((uint32_t)(x)) << INPUTMUX_PWM0_EXT_CLK_INP_SHIFT)) & INPUTMUX_PWM0_EXT_CLK_INP_MASK)
/*! @} */

/*! @name EXT_TRIG0 - External Trigger a Connections */
/*! @{ */

#define INPUTMUX_EXT_TRIG0_INP_MASK              (0x1FU)
#define INPUTMUX_EXT_TRIG0_INP_SHIFT             (0U)
/*! INP - External Trigger Input Connections
 *  0b00000..Reserved
 *  0b00001..Reserved
 *  0b00010..Reserved
 *  0b00011..Reserved
 *  0b00100..Reserved
 *  0b00101..Reserved
 *  0b00110..CMP0_OUT input is selected
 *  0b00111..Reserved
 *  0b01000..Reserved
 *  0b01001..LPUART0 ipp_do_lpuart_txd input is selected
 *  0b01010..LPUART1 ipp_do_lpuart_txd input is selected
 *  0b01011..LPUART2 ipp_do_lpuart_txd input is selected
 *  0b01100..LPUART3 ipp_do_lpuart_txd input is selected
 *  0b01101..Reserved
 *  0b01110..Reserved
 *  0b01111..Reserved
 *  0b10000..Reserved
 *  0b10001..Reserved
 *  0b10010..Reserved
 *  0b10011..RTC_1Hz_CLK input is selected
 */
#define INPUTMUX_EXT_TRIG0_INP(x)                (((uint32_t)(((uint32_t)(x)) << INPUTMUX_EXT_TRIG0_INP_SHIFT)) & INPUTMUX_EXT_TRIG0_INP_MASK)
/*! @} */

/*! @name EXT_TRIG1 - External Trigger a Connections */
/*! @{ */

#define INPUTMUX_EXT_TRIG1_INP_MASK              (0x1FU)
#define INPUTMUX_EXT_TRIG1_INP_SHIFT             (0U)
/*! INP - External Trigger Input Connections
 *  0b00000..Reserved
 *  0b00001..Reserved
 *  0b00010..Reserved
 *  0b00011..Reserved
 *  0b00100..Reserved
 *  0b00101..Reserved
 *  0b00110..CMP0_OUT input is selected
 *  0b00111..Reserved
 *  0b01000..Reserved
 *  0b01001..LPUART0 ipp_do_lpuart_txd input is selected
 *  0b01010..LPUART1 ipp_do_lpuart_txd input is selected
 *  0b01011..LPUART2 ipp_do_lpuart_txd input is selected
 *  0b01100..LPUART3 ipp_do_lpuart_txd input is selected
 *  0b01101..Reserved
 *  0b01110..Reserved
 *  0b01111..Reserved
 *  0b10000..Reserved
 *  0b10001..Reserved
 *  0b10010..Reserved
 *  0b10011..RTC_1Hz_CLK input is selected
 */
#define INPUTMUX_EXT_TRIG1_INP(x)                (((uint32_t)(((uint32_t)(x)) << INPUTMUX_EXT_TRIG1_INP_SHIFT)) & INPUTMUX_EXT_TRIG1_INP_MASK)
/*! @} */

/*! @name EXT_TRIG2 - External Trigger a Connections */
/*! @{ */

#define INPUTMUX_EXT_TRIG2_INP_MASK              (0x1FU)
#define INPUTMUX_EXT_TRIG2_INP_SHIFT             (0U)
/*! INP - External Trigger Input Connections
 *  0b00000..Reserved
 *  0b00001..Reserved
 *  0b00010..Reserved
 *  0b00011..Reserved
 *  0b00100..Reserved
 *  0b00101..Reserved
 *  0b00110..CMP0_OUT input is selected
 *  0b00111..Reserved
 *  0b01000..Reserved
 *  0b01001..LPUART0 ipp_do_lpuart_txd input is selected
 *  0b01010..LPUART1 ipp_do_lpuart_txd input is selected
 *  0b01011..LPUART2 ipp_do_lpuart_txd input is selected
 *  0b01100..LPUART3 ipp_do_lpuart_txd input is selected
 *  0b01101..Reserved
 *  0b01110..Reserved
 *  0b01111..Reserved
 *  0b10000..Reserved
 *  0b10001..Reserved
 *  0b10010..Reserved
 *  0b10011..RTC_1Hz_CLK input is selected
 */
#define INPUTMUX_EXT_TRIG2_INP(x)                (((uint32_t)(((uint32_t)(x)) << INPUTMUX_EXT_TRIG2_INP_SHIFT)) & INPUTMUX_EXT_TRIG2_INP_MASK)
/*! @} */

/*! @name EXT_TRIG3 - External Trigger a Connections */
/*! @{ */

#define INPUTMUX_EXT_TRIG3_INP_MASK              (0x1FU)
#define INPUTMUX_EXT_TRIG3_INP_SHIFT             (0U)
/*! INP - External Trigger Input Connections
 *  0b00000..Reserved
 *  0b00001..Reserved
 *  0b00010..Reserved
 *  0b00011..Reserved
 *  0b00100..Reserved
 *  0b00101..Reserved
 *  0b00110..CMP0_OUT input is selected
 *  0b00111..Reserved
 *  0b01000..Reserved
 *  0b01001..LPUART0 ipp_do_lpuart_txd input is selected
 *  0b01010..LPUART1 ipp_do_lpuart_txd input is selected
 *  0b01011..LPUART2 ipp_do_lpuart_txd input is selected
 *  0b01100..LPUART3 ipp_do_lpuart_txd input is selected
 *  0b01101..Reserved
 *  0b01110..Reserved
 *  0b01111..Reserved
 *  0b10000..Reserved
 *  0b10001..Reserved
 *  0b10010..Reserved
 *  0b10011..RTC_1Hz_CLK input is selected
 */
#define INPUTMUX_EXT_TRIG3_INP(x)                (((uint32_t)(((uint32_t)(x)) << INPUTMUX_EXT_TRIG3_INP_SHIFT)) & INPUTMUX_EXT_TRIG3_INP_MASK)
/*! @} */

/*! @name EXT_TRIG4 - External Trigger a Connections */
/*! @{ */

#define INPUTMUX_EXT_TRIG4_INP_MASK              (0x1FU)
#define INPUTMUX_EXT_TRIG4_INP_SHIFT             (0U)
/*! INP - External Trigger Input Connections
 *  0b00000..Reserved
 *  0b00001..Reserved
 *  0b00010..Reserved
 *  0b00011..Reserved
 *  0b00100..Reserved
 *  0b00101..Reserved
 *  0b00110..CMP0_OUT input is selected
 *  0b00111..Reserved
 *  0b01000..Reserved
 *  0b01001..LPUART0 ipp_do_lpuart_txd input is selected
 *  0b01010..LPUART1 ipp_do_lpuart_txd input is selected
 *  0b01011..LPUART2 ipp_do_lpuart_txd input is selected
 *  0b01100..LPUART3 ipp_do_lpuart_txd input is selected
 *  0b01101..Reserved
 *  0b01110..Reserved
 *  0b01111..Reserved
 *  0b10000..Reserved
 *  0b10001..Reserved
 *  0b10010..Reserved
 *  0b10011..RTC_1Hz_CLK input is selected
 */
#define INPUTMUX_EXT_TRIG4_INP(x)                (((uint32_t)(((uint32_t)(x)) << INPUTMUX_EXT_TRIG4_INP_SHIFT)) & INPUTMUX_EXT_TRIG4_INP_MASK)
/*! @} */

/*! @name EXT_TRIG6 - External Trigger a Connections */
/*! @{ */

#define INPUTMUX_EXT_TRIG6_INP_MASK              (0x1FU)
#define INPUTMUX_EXT_TRIG6_INP_SHIFT             (0U)
/*! INP - External Trigger Input Connections
 *  0b00000..Reserved
 *  0b00001..Reserved
 *  0b00010..Reserved
 *  0b00011..Reserved
 *  0b00100..Reserved
 *  0b00101..Reserved
 *  0b00110..CMP0_OUT input is selected
 *  0b00111..Reserved
 *  0b01000..Reserved
 *  0b01001..LPUART0 ipp_do_lpuart_txd input is selected
 *  0b01010..LPUART1 ipp_do_lpuart_txd input is selected
 *  0b01011..LPUART2 ipp_do_lpuart_txd input is selected
 *  0b01100..LPUART3 ipp_do_lpuart_txd input is selected
 *  0b01101..Reserved
 *  0b01110..Reserved
 *  0b01111..Reserved
 *  0b10000..Reserved
 *  0b10001..Reserved
 *  0b10010..Reserved
 *  0b10011..RTC_1Hz_CLK input is selected
 */
#define INPUTMUX_EXT_TRIG6_INP(x)                (((uint32_t)(((uint32_t)(x)) << INPUTMUX_EXT_TRIG6_INP_SHIFT)) & INPUTMUX_EXT_TRIG6_INP_MASK)
/*! @} */

/*! @name EXT_TRIG7 - External Trigger a Connections */
/*! @{ */

#define INPUTMUX_EXT_TRIG7_INP_MASK              (0x1FU)
#define INPUTMUX_EXT_TRIG7_INP_SHIFT             (0U)
/*! INP - External Trigger Input Connections
 *  0b00000..Reserved
 *  0b00001..Reserved
 *  0b00010..Reserved
 *  0b00011..Reserved
 *  0b00100..Reserved
 *  0b00101..Reserved
 *  0b00110..CMP0_OUT input is selected
 *  0b00111..Reserved
 *  0b01000..Reserved
 *  0b01001..LPUART0 ipp_do_lpuart_txd input is selected
 *  0b01010..LPUART1 ipp_do_lpuart_txd input is selected
 *  0b01011..LPUART2 ipp_do_lpuart_txd input is selected
 *  0b01100..LPUART3 ipp_do_lpuart_txd input is selected
 *  0b01101..Reserved
 *  0b01110..Reserved
 *  0b01111..Reserved
 *  0b10000..Reserved
 *  0b10001..Reserved
 *  0b10010..Reserved
 *  0b10011..RTC_1Hz_CLK input is selected
 */
#define INPUTMUX_EXT_TRIG7_INP(x)                (((uint32_t)(((uint32_t)(x)) << INPUTMUX_EXT_TRIG7_INP_SHIFT)) & INPUTMUX_EXT_TRIG7_INP_MASK)
/*! @} */

/*! @name LPI2C0_TRIG - LPI2C0 Trigger Input Connections */
/*! @{ */

