zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXC/periph3/PERI_INPUTMUX.h
#define INPUTMUX_LPI2C0_TRIG_INP_MASK            (0x1FU)
#define INPUTMUX_LPI2C0_TRIG_INP_SHIFT           (0U)
/*! INP - LPI2C0 Trigger Input Connections
 *  0b00000..Reserved
 *  0b00001..Reserved
 *  0b00010..Reserved
 *  0b00011..Reserved
 *  0b00100..Reserved
 *  0b00101..Reserved
 *  0b00110..CMP0_OUT input is selected
 *  0b00111..Reserved
 *  0b01000..Reserved
 *  0b01001..CTimer0_MAT0 input is selected
 *  0b01010..CTimer0_MAT1 input is selected
 *  0b01011..CTimer1_MAT0 input is selected
 *  0b01100..CTimer1_MAT1 input is selected
 *  0b01101..Reserved
 *  0b01110..Reserved
 *  0b01111..LPTMR0 input is selected
 *  0b10000..Reserved
 *  0b10001..TRIG_IN0 input is selected
 *  0b10010..TRIG_IN1 input is selected
 *  0b10011..TRIG_IN2 input is selected
 *  0b10100..TRIG_IN3 input is selected
 *  0b10101..TRIG_IN4 input is selected
 *  0b10110..TRIG_IN5 input is selected
 *  0b10111..TRIG_IN6 input is selected
 *  0b11000..TRIG_IN7 input is selected
 *  0b11001..GPIO0 Pin Event Trig 0 input is selected
 *  0b11010..GPIO1 Pin Event Trig 0 input is selected
 *  0b11011..GPIO2 Pin Event Trig 0 input is selected
 *  0b11100..GPIO3 Pin Event Trig 0 input is selected
 *  0b11101..Reserved
 *  0b11110..WUU input is selected
 */
#define INPUTMUX_LPI2C0_TRIG_INP(x)              (((uint32_t)(((uint32_t)(x)) << INPUTMUX_LPI2C0_TRIG_INP_SHIFT)) & INPUTMUX_LPI2C0_TRIG_INP_MASK)
/*! @} */

/*! @name LPSPI0_TRIG - LPSPI0 Trigger Input Connections */
/*! @{ */

#define INPUTMUX_LPSPI0_TRIG_INP_MASK            (0x1FU)
#define INPUTMUX_LPSPI0_TRIG_INP_SHIFT           (0U)
/*! INP - LPSPI0 Trigger Input Connections
 *  0b00000..Reserved
 *  0b00001..Reserved
 *  0b00010..Reserved
 *  0b00011..Reserved
 *  0b00100..Reserved
 *  0b00101..Reserved
 *  0b00110..CMP0_OUT input is selected
 *  0b00111..Reserved
 *  0b01000..Reserved
 *  0b01001..CTimer0_MAT1 input is selected
 *  0b01010..CTimer0_MAT2 input is selected
 *  0b01011..CTimer1_MAT1 input is selected
 *  0b01100..CTimer1_MAT2 input is selected
 *  0b01101..Reserved
 *  0b01110..Reserved
 *  0b01111..LPTMR0 input is selected
 *  0b10000..Reserved
 *  0b10001..TRIG_IN0 input is selected
 *  0b10010..TRIG_IN1 input is selected
 *  0b10011..TRIG_IN2 input is selected
 *  0b10100..TRIG_IN3 input is selected
 *  0b10101..TRIG_IN4 input is selected
 *  0b10110..TRIG_IN5 input is selected
 *  0b10111..TRIG_IN6 input is selected
 *  0b11000..TRIG_IN7 input is selected
 *  0b11001..GPIO0 Pin Event Trig 0 input is selected
 *  0b11010..GPIO1 Pin Event Trig 0 input is selected
 *  0b11011..GPIO2 Pin Event Trig 0 input is selected
 *  0b11100..GPIO3 Pin Event Trig 0 input is selected
 *  0b11101..Reserved
 *  0b11110..WUU input is selected
 */
#define INPUTMUX_LPSPI0_TRIG_INP(x)              (((uint32_t)(((uint32_t)(x)) << INPUTMUX_LPSPI0_TRIG_INP_SHIFT)) & INPUTMUX_LPSPI0_TRIG_INP_MASK)
/*! @} */

/*! @name LPUART0 - LPUART0 Trigger Input Connections */
/*! @{ */

#define INPUTMUX_LPUART0_INP_MASK                (0x3FU)
#define INPUTMUX_LPUART0_INP_SHIFT               (0U)
/*! INP - LPUART0 Trigger Input Connections
 *  0b000000..Reserved
 *  0b000001..Reserved
 *  0b000010..Reserved
 *  0b000011..Reserved
 *  0b000100..Reserved
 *  0b000101..Reserved
 *  0b000110..CMP0_OUT input is selected
 *  0b000111..Reserved
 *  0b001000..Reserved
 *  0b001001..CTimer0_MAT2 input is selected
 *  0b001010..CTimer0_MAT3 input is selected
 *  0b001011..CTimer1_MAT2 input is selected
 *  0b001100..CTimer1_MAT3 input is selected
 *  0b001101..Reserved
 *  0b001110..Reserved
 *  0b001111..LPTMR0 input is selected
 *  0b010000..Reserved
 *  0b010001..TRIG_IN0 input is selected
 *  0b010010..TRIG_IN1 input is selected
 *  0b010011..TRIG_IN2 input is selected
 *  0b010100..TRIG_IN3 input is selected
 *  0b010101..TRIG_IN4 input is selected
 *  0b010110..TRIG_IN5 input is selected
 *  0b010111..TRIG_IN6 input is selected
 *  0b011000..TRIG_IN7 input is selected
 *  0b011001..TRIG_IN8 input is selected
 *  0b011010..TRIG_IN9 input is selected
 *  0b011011..TRIG_IN10 input is selected
 *  0b011100..TRIG_IN11 input is selected
 *  0b011101..GPIO0 Pin Event Trig 0 input is selected
 *  0b011110..GPIO1 Pin Event Trig 0 input is selected
 *  0b011111..GPIO2 Pin Event Trig 0 input is selected
 *  0b100000..GPIO3 Pin Event Trig 0 input is selected
 *  0b100001..Reserved
 *  0b100010..WUU input is selected
 *  0b100011..Reserved
 *  0b100100..Reserved
 *  0b100101..Reserved
 *  0b100110..Reserved
 *  0b100111..Reserved
 *  0b101000..Reserved
 *  0b101001..Reserved
 *  0b101010..Reserved
 *  0b101011..Reserved
 *  0b101100..Reserved
 *  0b101101..Reserved
 *  0b101110..Reserved
 *  0b101111..Reserved
 */
#define INPUTMUX_LPUART0_INP(x)                  (((uint32_t)(((uint32_t)(x)) << INPUTMUX_LPUART0_INP_SHIFT)) & INPUTMUX_LPUART0_INP_MASK)
/*! @} */

/*! @name LPUART1 - LPUART1 Trigger Input Connections */
/*! @{ */

#define INPUTMUX_LPUART1_INP_MASK                (0x3FU)
#define INPUTMUX_LPUART1_INP_SHIFT               (0U)
/*! INP - LPUART1 Trigger Input Connections
 *  0b000000..Reserved
 *  0b000001..Reserved
 *  0b000010..Reserved
 *  0b000011..Reserved
 *  0b000100..Reserved
 *  0b000101..Reserved
 *  0b000110..CMP0_OUT input is selected
 *  0b000111..Reserved
 *  0b001000..Reserved
 *  0b001001..CTimer0_MAT2 input is selected
 *  0b001010..CTimer0_MAT3 input is selected
 *  0b001011..CTimer1_MAT2 input is selected
 *  0b001100..CTimer1_MAT3 input is selected
 *  0b001101..Reserved
 *  0b001110..Reserved
 *  0b001111..LPTMR0 input is selected
 *  0b010000..Reserved
 *  0b010001..TRIG_IN0 input is selected
 *  0b010010..TRIG_IN1 input is selected
 *  0b010011..TRIG_IN2 input is selected
 *  0b010100..TRIG_IN3 input is selected
 *  0b010101..TRIG_IN4 input is selected
 *  0b010110..TRIG_IN5 input is selected
 *  0b010111..TRIG_IN6 input is selected
 *  0b011000..TRIG_IN7 input is selected
 *  0b011001..TRIG_IN8 input is selected
 *  0b011010..TRIG_IN9 input is selected
 *  0b011011..TRIG_IN10 input is selected
 *  0b011100..TRIG_IN11 input is selected
 *  0b011101..GPIO0 Pin Event Trig 0 input is selected
 *  0b011110..GPIO1 Pin Event Trig 0 input is selected
 *  0b011111..GPIO2 Pin Event Trig 0 input is selected
 *  0b100000..GPIO3 Pin Event Trig 0 input is selected
 *  0b100001..Reserved
 *  0b100010..WUU input is selected
 *  0b100011..Reserved
 *  0b100100..Reserved
 *  0b100101..Reserved
 *  0b100110..Reserved
 *  0b100111..Reserved
 *  0b101000..Reserved
 *  0b101001..Reserved
 *  0b101010..Reserved
 *  0b101011..Reserved
 *  0b101100..Reserved
 *  0b101101..Reserved
 *  0b101110..Reserved
 *  0b101111..Reserved
 */
#define INPUTMUX_LPUART1_INP(x)                  (((uint32_t)(((uint32_t)(x)) << INPUTMUX_LPUART1_INP_SHIFT)) & INPUTMUX_LPUART1_INP_MASK)
/*! @} */

/*! @name LPUART2 - LPUART2 Trigger Input Connections */
/*! @{ */

#define INPUTMUX_LPUART2_INP_MASK                (0x3FU)
#define INPUTMUX_LPUART2_INP_SHIFT               (0U)
/*! INP - LPUART2 Trigger Input Connections
 *  0b000000..Reserved
 *  0b000001..Reserved
 *  0b000010..Reserved
 *  0b000011..Reserved
 *  0b000100..Reserved
 *  0b000101..Reserved
 *  0b000110..CMP0_OUT input is selected
 *  0b000111..Reserved
 *  0b001000..Reserved
 *  0b001001..CTimer0_MAT2 input is selected
 *  0b001010..CTimer0_MAT3 input is selected
 *  0b001011..CTimer1_MAT2 input is selected
 *  0b001100..CTimer1_MAT3 input is selected
 *  0b001101..Reserved
 *  0b001110..Reserved
 *  0b001111..LPTMR0 input is selected
 *  0b010000..Reserved
 *  0b010001..TRIG_IN0 input is selected
 *  0b010010..TRIG_IN1 input is selected
 *  0b010011..TRIG_IN2 input is selected
 *  0b010100..TRIG_IN3 input is selected
 *  0b010101..TRIG_IN4 input is selected
 *  0b010110..TRIG_IN5 input is selected
 *  0b010111..TRIG_IN6 input is selected
 *  0b011000..TRIG_IN7 input is selected
 *  0b011001..TRIG_IN8 input is selected
 *  0b011010..TRIG_IN9 input is selected
 *  0b011011..TRIG_IN10 input is selected
 *  0b011100..TRIG_IN11 input is selected
 *  0b011101..GPIO0 Pin Event Trig 0 input is selected
 *  0b011110..GPIO1 Pin Event Trig 0 input is selected
 *  0b011111..GPIO2 Pin Event Trig 0 input is selected
 *  0b100000..GPIO3 Pin Event Trig 0 input is selected
 *  0b100001..Reserved
 *  0b100010..WUU input is selected
 *  0b100011..Reserved
 *  0b100100..Reserved
 *  0b100101..Reserved
 *  0b100110..Reserved
 *  0b100111..Reserved
 *  0b101000..Reserved
 *  0b101001..Reserved
 *  0b101010..Reserved
 *  0b101011..Reserved
 *  0b101100..Reserved
 *  0b101101..Reserved
 *  0b101110..Reserved
 *  0b101111..Reserved
 */
#define INPUTMUX_LPUART2_INP(x)                  (((uint32_t)(((uint32_t)(x)) << INPUTMUX_LPUART2_INP_SHIFT)) & INPUTMUX_LPUART2_INP_MASK)
/*! @} */

/*! @name LPUART3 - LPUART3 Trigger Input Connections */
/*! @{ */

#define INPUTMUX_LPUART3_INP_MASK                (0x3FU)
#define INPUTMUX_LPUART3_INP_SHIFT               (0U)
/*! INP - LPUART3 Trigger Input Connections
 *  0b000000..Reserved
 *  0b000001..Reserved
 *  0b000010..Reserved
 *  0b000011..Reserved
 *  0b000100..Reserved
 *  0b000101..Reserved
 *  0b000110..CMP0_OUT input is selected
 *  0b000111..Reserved
 *  0b001000..Reserved
 *  0b001001..CTimer0_MAT2 input is selected
 *  0b001010..CTimer0_MAT3 input is selected
 *  0b001011..CTimer1_MAT2 input is selected
 *  0b001100..CTimer1_MAT3 input is selected
 *  0b001101..Reserved
 *  0b001110..Reserved
 *  0b001111..LPTMR0 input is selected
 *  0b010000..Reserved
 *  0b010001..TRIG_IN0 input is selected
 *  0b010010..TRIG_IN1 input is selected
 *  0b010011..TRIG_IN2 input is selected
 *  0b010100..TRIG_IN3 input is selected
 *  0b010101..TRIG_IN4 input is selected
 *  0b010110..TRIG_IN5 input is selected
 *  0b010111..TRIG_IN6 input is selected
 *  0b011000..TRIG_IN7 input is selected
 *  0b011001..TRIG_IN8 input is selected
 *  0b011010..TRIG_IN9 input is selected
 *  0b011011..TRIG_IN10 input is selected
 *  0b011100..TRIG_IN11 input is selected
 *  0b011101..GPIO0 Pin Event Trig 0 input is selected
 *  0b011110..GPIO1 Pin Event Trig 0 input is selected
 *  0b011111..GPIO2 Pin Event Trig 0 input is selected
 *  0b100000..GPIO3 Pin Event Trig 0 input is selected
 *  0b100001..Reserved
 *  0b100010..WUU input is selected
 *  0b100011..Reserved
 *  0b100100..Reserved
 *  0b100101..Reserved
 *  0b100110..Reserved
 *  0b100111..Reserved
 *  0b101000..Reserved
 *  0b101001..Reserved
 *  0b101010..Reserved
 *  0b101011..Reserved
 *  0b101100..Reserved
 *  0b101101..Reserved
 *  0b101110..Reserved
 *  0b101111..Reserved
 */
#define INPUTMUX_LPUART3_INP(x)                  (((uint32_t)(((uint32_t)(x)) << INPUTMUX_LPUART3_INP_SHIFT)) & INPUTMUX_LPUART3_INP_MASK)
/*! @} */

/*! @name TRIGFIL_PRSC - Trigger Filter Prescaller */
/*! @{ */

#define INPUTMUX_TRIGFIL_PRSC_FILT_SCALE_VAL_MASK (0x3U)
#define INPUTMUX_TRIGFIL_PRSC_FILT_SCALE_VAL_SHIFT (0U)
/*! FILT_SCALE_VAL - Filter Prescaller Value
 *  0b00..Bypass the clock
 *  0b01..Divide 2
 *  0b10..Divide 4
 *  0b11..Divide 8
 */
#define INPUTMUX_TRIGFIL_PRSC_FILT_SCALE_VAL(x)  (((uint32_t)(((uint32_t)(x)) << INPUTMUX_TRIGFIL_PRSC_FILT_SCALE_VAL_SHIFT)) & INPUTMUX_TRIGFIL_PRSC_FILT_SCALE_VAL_MASK)

#define INPUTMUX_TRIGFIL_PRSC_FILT_SCALE_EN_MASK (0x80000000U)
#define INPUTMUX_TRIGFIL_PRSC_FILT_SCALE_EN_SHIFT (31U)
/*! FILT_SCALE_EN - Trigger Filter Prescaller Enable
 *  0b0..Disable prescaller
 *  0b1..Enabled prescaller
 */
#define INPUTMUX_TRIGFIL_PRSC_FILT_SCALE_EN(x)   (((uint32_t)(((uint32_t)(x)) << INPUTMUX_TRIGFIL_PRSC_FILT_SCALE_EN_SHIFT)) & INPUTMUX_TRIGFIL_PRSC_FILT_SCALE_EN_MASK)
/*! @} */

/*! @name TRIGFIL_STAT0 - Trigger Filter Status */
/*! @{ */

